import { IData } from 'Controls-demo/gridNew/DemoHelpers/DataCatalog';

export const TrackedProperties = {
    getData: (): IData[] => {
        return [
            {
                key: 1,
                date: '15 ноя',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 2,
                date: '16 ноя',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 3,
                date: '31 окт',
                name: '6-НДФЛ',
            },
            {
                key: 4,
                date: '31 окт',
                name: 'Расчет по страховым взносам',
            },
            {
                key: 5,
                date: '28 окт',
                name: 'НД по прибыли',
            },
            {
                key: 6,
                date: '25 окт',
                name: '4-ФСС',
            },
            {
                key: 7,
                date: '25 окт',
                name: 'НД по НДС',
            },
            {
                key: 8,
                date: '20 окт',
                name: 'Журнал учета счетов-фактур',
            },
            {
                key: 9,
                date: '17 окт',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 10,
                date: '14 окт',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 11,
                date: '15 сен',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 12,
                date: '14 сен',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 13,
                date: '15 авг',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 14,
                date: '15 авг',
                name: 'Шаблон для тестирования формы и к.с.',
            },
            {
                key: 15,
                date: '12 авг',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 16,
                date: '1 авг',
                name: '6-НДФЛ',
            },
            {
                key: 17,
                date: '1 авг',
                name: 'Расчет по страховым взносам',
            },
            {
                key: 18,
                date: '28 июл',
                name: 'НД по прибыли',
            },
            {
                key: 19,
                date: '25 июл',
                name: '4-ФСС',
            },
            {
                key: 20,
                date: '20 июл',
                name: 'Журнал учета счетов-фактур',
            },
            {
                key: 21,
                date: '15 июл',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 22,
                date: '14 июл',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 23,
                date: '15 июн',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 24,
                date: '15 июн',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 25,
                date: '20 мая',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 26,
                date: '19 мая',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 27,
                date: '16 мая',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
        ];
    },
};
