import { IData } from 'Controls-demo/gridNew/DemoHelpers/DataCatalog';

export const TrackedProperties = {
    getData: (): IData[] => {
        return [
            {
                key: 1,
                month: 'ноя',
                day: '15',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 2,
                month: 'ноя',
                day: '15',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 3,
                month: 'окт',
                day: '31',
                name: '6-НДФЛ',
            },
            {
                key: 4,
                month: 'окт',
                day: '31',
                name: 'Расчет по страховым взносам',
            },
            {
                key: 5,
                month: 'окт',
                day: '28',
                name: 'НД по прибыли',
            },
            {
                key: 6,
                month: 'окт',
                day: '25',
                name: '4-ФСС',
            },
            {
                key: 7,
                month: 'окт',
                day: '25',
                name: 'НД по НДС',
            },
            {
                key: 8,
                month: 'окт',
                day: '20',
                name: 'Журнал учета счетов-фактур',
            },
            {
                key: 9,
                month: 'окт',
                day: '17',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 10,
                month: 'окт',
                day: '14',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 11,
                month: 'сен',
                day: '15',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 12,
                month: 'сен',
                day: '14',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 13,
                month: 'авг',
                day: '15',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 14,
                month: 'авг',
                day: '15',
                name: 'Шаблон для тестирования формы и к.с.',
            },
            {
                key: 15,
                month: 'авг',
                day: '12',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 16,
                month: 'авг',
                day: '1',
                name: '6-НДФЛ',
            },
            {
                key: 17,
                month: 'авг',
                day: '1',
                name: 'Расчет по страховым взносам',
            },
            {
                key: 18,
                month: 'июл',
                day: '28',
                name: 'НД по прибыли',
            },
            {
                key: 19,
                month: 'июл',
                day: '25',
                name: '4-ФСС',
            },
            {
                key: 20,
                month: 'июл',
                day: '20',
                name: 'Журнал учета счетов-фактур',
            },
            {
                key: 21,
                month: 'июл',
                day: '15',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 22,
                month: 'июл',
                day: '14',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 23,
                month: 'июн',
                day: '15',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 24,
                month: 'июн',
                day: '15',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 25,
                month: 'мая',
                day: '20',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
            {
                key: 26,
                month: 'мая',
                day: '19',
                name: 'П-1 Производство и отгрузка товаров',
            },
            {
                key: 27,
                month: 'мая',
                day: '16',
                name: 'СЗВ-М Сведения о застрахованных лицах',
            },
        ];
    },
};
