export const JOBS_LIST = [
    'Инженер-программист (3 категории)',
    'Инженер-программист (3+ категории)',
    'Инженер-программист (2 категории)',
    'Инженер-программист (2+ категории)',
    'Инженер-программист (1 категории)',
    'Инженер-программист (1+ категории)',
    'Ведущий инженер-программист (3 категории)',
    'Ведущий инженер-программист (3+ категории)',
    'Ведущий инженер-программист (2 категории)',
    'Ведущий инженер-программист (2+ категории)',
    'Ведущий инженер-программист (1 категории)',
    'Ведущий инженер-программист (1+ категории)',
];
export const staffWithJobs = [
    {
        name: 'Калинина Ника',
        jobs: [
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Яковлева Софья',
        jobs: ['Инженер-программист (2+ категории)', 'Инженер-программист (2 категории)'],
        currentCategory: '2',
    },
    {
        name: 'Сидорова Алиса',
        jobs: ['Инженер-программист (3+ категории)'],
        currentCategory: '3+',
    },
    {
        name: 'Антонова Валерия',
        jobs: [
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Карпова Полина',
        jobs: ['Инженер-программист (1 категории)'],
        currentCategory: '1',
    },
    {
        name: 'Некрасов Михаил',
        jobs: [
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
            'Ведущий инженер-программист (1+ категории)',
        ],
        currentCategory: 'В1+',
    },
    {
        name: 'Ильин Матвей',
        jobs: ['Инженер-программист (2+ категории)'],
        currentCategory: '2+',
    },
    {
        name: 'Виноградов Алексей',
        jobs: ['Ведущий инженер-программист (2 категории)'],
        currentCategory: 'В2',
    },
    {
        name: 'Ткачева София',
        jobs: [
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В1',
    },
    {
        name: 'Степанова Милана',
        jobs: ['Ведущий инженер-программист (1 категории)'],
        currentCategory: 'В1',
    },
    {
        name: 'Казакова Варвара',
        jobs: [
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Любимова Юлия',
        jobs: [
            'Инженер-программист (3+ категории)',
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
        ],
        currentCategory: '2+',
    },
    {
        name: 'Попов Алексей',
        jobs: ['Инженер-программист (2 категории)', 'Инженер-программист (1 категории)'],
        currentCategory: '1',
    },
    {
        name: 'Афанасьева Мадина',
        jobs: [
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Беляев Данил',
        jobs: ['Инженер-программист (1 категории)'],
        currentCategory: '1',
    },
    {
        name: 'Прокофьев Даниил',
        jobs: [
            'Ведущий инженер-программист (3 категории)',
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1+ категории)',
        ],
        currentCategory: 'В1+',
    },
    {
        name: 'Третьяков Илья',
        jobs: [
            'Ведущий инженер-программист (3+ категории)',
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
            'Ведущий инженер-программист (1+ категории)',
        ],
        currentCategory: 'В1+',
    },
    {
        name: 'Соболев Алексей',
        jobs: ['Ведущий инженер-программист (2 категории)'],
        currentCategory: 'В2',
    },
    {
        name: 'Аникин Максим',
        jobs: [
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В2+',
    },
    {
        name: 'Лукина София',
        jobs: ['Ведущий инженер-программист (3 категории)'],
        currentCategory: 'В3',
    },
    {
        name: 'Цветкова София',
        jobs: [
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Сазонов Арсений',
        jobs: [
            'Инженер-программист (3+ категории)',
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1+',
    },
    {
        name: 'Воронин Виктор',
        jobs: ['Инженер-программист (2 категории)', 'Инженер-программист (1 категории)'],
        currentCategory: '1',
    },
    {
        name: 'Дубровина Виктория',
        jobs: [
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Короткова Арина',
        jobs: ['Инженер-программист (1 категории)'],
        currentCategory: '1',
    },
    {
        name: 'Захарова Мария',
        jobs: [
            'Ведущий инженер-программист (3 категории)',
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В1',
    },
    {
        name: 'Власова Полина',
        jobs: [
            'Ведущий инженер-программист (3 категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
            'Ведущий инженер-программист (1+ категории)',
        ],
        currentCategory: 'В1+',
    },
    {
        name: 'Семенова София',
        jobs: [
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В1',
    },
    {
        name: 'Алешина Малика',
        jobs: [
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В1',
    },
    {
        name: 'Михайлова Анна',
        jobs: ['Инженер-программист (1+ категории)'],
        currentCategory: '1+',
    },
    {
        name: 'Семенова Виктория',
        jobs: [
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
            'Инженер-программист (2 категории)',
            'Инженер-программист (1 категории)',
        ],
        currentCategory: '1',
    },
    {
        name: 'Петрова Ника',
        jobs: [
            'Инженер-программист (3+ категории)',
            'Инженер-программист (3 категории)',
            'Инженер-программист (2+ категории)',
        ],
        currentCategory: '2+',
    },
    {
        name: 'Соловьев Камиль',
        jobs: ['Инженер-программист (2 категории)'],
        currentCategory: '2',
    },
    {
        name: 'Колосова Ксения',
        jobs: ['Инженер-программист (3+ категории)'],
        currentCategory: '3+',
    },
    {
        name: 'Белоусова София',
        jobs: ['Инженер-программист (1 категории)'],
        currentCategory: '1',
    },
    {
        name: 'Фролова Мария',
        jobs: ['Ведущий инженер-программист (3 категории)'],
        currentCategory: 'В3',
    },
    {
        name: 'Соколова Арина',
        jobs: [
            'Ведущий инженер-программист (3+ категории)',
            'Ведущий инженер-программист (3 категории)',
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В1',
    },
    {
        name: 'Исаев Леонид',
        jobs: ['Ведущий инженер-программист (2 категории)'],
        currentCategory: 'В2',
    },
    {
        name: 'Кузина Маргарита',
        jobs: [
            'Ведущий инженер-программист (2+ категории)',
            'Ведущий инженер-программист (2 категории)',
            'Ведущий инженер-программист (1 категории)',
        ],
        currentCategory: 'В1',
    },
    {
        name: 'Островская Ольга',
        jobs: ['Ведущий инженер-программист (1+ категории)'],
        currentCategory: 'В1+',
    },
];
